УТ/src/Catalogs/CRM_ПричиныОтказаПоИнтересам/CRM_ПричиныОтказаПоИнтересам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПричиныОтказаПоИнтересам</name>
  <comment>Причины завершения интересов и обращений</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Выполнено</name>
      <description>Выполнено</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.CRM_ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ПричиныОтказаПоИнтересам/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сценарий") И Параметры.Свойство("ТипОбращения") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Сценарий) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Сценарий", Параметры.Сценарий);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ТипОбращения) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ТипОбращения", Параметры.ТипОбращения);
		КонецЕсли;
		
		Если Параметры.Свойство("ИсключаемыеПричины") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ИсключаемыеПричины", Параметры.ИсключаемыеПричины);
		КонецЕсли;
		
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|СправочникCRM_ПричиныОтказаПоИнтересам.Ссылка КАК Ссылка,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ПометкаУдаления КАК ПометкаУдаления,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Родитель КАК Родитель,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ЭтоГруппа КАК ЭтоГруппа,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Код КАК Код,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Наименование КАК Наименование,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ТипОбращения КАК ТипОбращения,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Сценарий КАК Сценарий,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ОтображатьПоУмолчанию КАК ОтображатьПоУмолчанию,
		|СправочникCRM_ПричиныОтказаПоИнтересам.Предопределенный КАК Предопределенный,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|СправочникCRM_ПричиныОтказаПоИнтересам.ВерсияДанных КАК ВерсияДанных
		|ИЗ
		|Справочник.CRM_ПричиныОтказаПоИнтересам КАК СправочникCRM_ПричиныОтказаПоИнтересам";
	
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
